Tekla Open API Reference for Tekla Structures 2025
InvalidFilterExpressionException.OperatorType Property
 Gets the invalid expression's operator.
 Namespace: Tekla.Structures.Filtering
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public OperatorType OperatorType { get; }
Public ReadOnly Property OperatorType As OperatorType
	Get
Property Value
Type: OperatorType
See Also
Reference
InvalidFilterExpressionException Class
Tekla.Structures.Filtering Namespace